# Counting
In this notebook we will study some important features about Star Wars movies based on counting the number of nodes and relationships between them. We will analyse:
- Which characters have the most appearences in all the movies
- Which movie has the most characters / edges
- Which node has the most edges

In [1]:
%load_ext icypher
%cypher http://roberto:neo4j@localhost:7474/db/data

In [10]:
from neo4j import GraphDatabase, basic_auth
import pandas as pd

In [7]:
uri = "bolt://localhost:7687"
user = "neo4j"
password = "neo4j"

driver = GraphDatabase.driver(uri, auth=basic_auth(user, password))
session = driver.session(database="neo4j")

## Which characters have the most appearences in all the movies

In [12]:
most_appear = '''
    MATCH p=(n)-[:APPEARS_IN]->()
    WHERE n:Person OR n:Droid
    RETURN n.name AS Name, count(RELATIONSHIPS(p)) AS Appearances
    ORDER BY Appearances DESC, Name
'''
results = session.read_transaction(
        lambda tx: tx.run(most_appear).data())
df = pd.DataFrame(results)
df

            Name  Appearances
0          C-3PO            7
1          R2-D2            7
2        OBI-WAN            6
3        EMPEROR            5
4           YODA            5
..           ...          ...
107  UNKAR PLUTT            1
108      VALORUM            1
109         WALD            1
110    YOLO ZIFF            1
111          ZEV            1

[112 rows x 2 columns]

## Which movie has the most characters/edges

In [13]:
most_char = '''
    MATCH p=()--(m:Movie)
    RETURN m.name AS Title, count(p) AS NumberOfCharacters
    ORDER BY NumberOfCharacters DESC, Title
'''
results = session.read_transaction(
        lambda tx: tx.run(most_char).data())
df = pd.DataFrame(results)
df

                                Title  NumberOfCharacters
0       Episode I: The Phantom Menace                  38
1    Episode II: Attack of the Clones                  33
2      Episode VII: The Force Awakens                  27
3    Episode III: Revenge of the Sith                  25
4              Episode IV: A New Hope                  22
5  Episode V: The Empire Strikes Back                  21
6      Episode VI: Return of the Jedi                  20

## Which node has the most edges

In [14]:
most_edges = '''
    MATCH p=(n)--()
    RETURN n.name AS Name, count(RELATIONSHIPS(p)) AS NumberOfEdges
    ORDER BY NumberOfEdges DESC, Name
'''
results = session.read_transaction(
        lambda tx: tx.run(most_edges).data())
df = pd.DataFrame(results)
df

                              Name  NumberOfEdges
0                           ANAKIN             46
1                            C-3PO             43
2                          OBI-WAN             43
3    Episode I: The Phantom Menace             38
4                            PADME             37
..                             ...            ...
114                         JANSON              2
115                      JERJERROD              2
116                        TARPALS              2
117                     TION MEDON              2
118                      GOLD FIVE              1

[119 rows x 2 columns]